<?php

function helmkey($arg1x,$arg1y,$arg2x,$arg2y){
/*Подразумеваем что размер массивов на входе одинаковый*/
/* Результат:
$out[0] - массив невязок X
$out[1] - массив невязок Y
$out[3] = Коэффициэнт К
$out[4] = X_0
$out[5] = Y_0
$out[6] = gamma
*/
/*Cуммируем координаты*/
	for($i = 0; $i < count($arg1x); $i++){
		$s[0] += $arg1x[$i];
		$s[1] += $arg1y[$i];
		$s[2] += $arg2x[$i];
		$s[3] += $arg2y[$i];
	}
	$s[4]=$i+1;
/*Центр гравитации*/
	for($i = 0; $i < 2; $i++){
    	$xc[$i] = $s[$i] / $s[4];
    	$yc[$i] = $s[2 + $i] / $s[4];
	}
/*Сумма продуктов*/
	for($i = 0; $i < 7; $i++){
    	$s[$i] = 0;
	}
	for($i = 0; $i < count($arg1x); $i++){
/*Разница координат*/		
		$dx[0] = $arg1x[$i] - $xc[0];
		$dx[1] = $arg1y[$i] - $xc[1];
		$dy[0] = $arg2x[$i] - $yc[0];
		$dy[1] = $arg2y[$i] - $yc[1];	
/*Сумируем*/
		$s[0] += $dx[0] * $dx[0];
/*		$s[1] += $dx[0] * $dx[1]; Закомментировал автор */
		$s[2] += $dx[1] * $dx[1];
		$s[3] += $dx[0] * $dy[0];
		$s[4] += $dx[1] * $dy[0];
		$s[5] += $dx[0] * $dy[1];
		$s[6] += $dx[1] * $dy[1];
	}
	
/*Helmert параметры*/
	$det = $s[0] + $s[2];
	$h[0] = ($s[3] + $s[6]) / $det;
	$h[1] = ($s[4] - $s[5]) / $det;
	$h[2] = $yc[0] - $h[0] * $xc[0] - $h[1] * $xc[1];
	$h[3] = -$h[1];  /* Test it!*/
	$h[4] = $h[0];
	$h[5] = $yc[1] - $h[3] * $xc[0] - $h[4] * $xc[1];	
	
/*Установка альтернативных параметров Helmert*/
	$mu = hypot($h[0], $h[1]);
	$theta = atan2($h[1], $h[0]);
/*Печатаем на выход*/
	$out[3] = $mu;
	$out[4] = $h[2];
	$out[5] = $h[5];
	$out[6] = $theta / pi() * 180;
/*	echo '+k='.$mu.' +x_0='.$h[2].' +y_0='.$h[5].' +gamma='.($theta / pi() * 180); Вывод на печать отключен*/
 
/* Выходные остатки */
	for($i = 0; $i < count($arg1x); $i++){
/*Модель У*/
	    $yh[0] = $h[0] * $arg1x[$i] + $h[1] * $arg1y[$i] + $h[2];
	    $yh[1] = $h[3] * $arg2x[$i] + $h[4] * $arg2y[$i] + $h[5];
		$out[0][$i] = $yh[0] - $arg2x[$i];
		$out[1][$i] = $yh[1] - $arg2y[$i];
	}
	
	return $out;
}

?>