<?php
// Конформное преобразование для вычисления параметров МСК
function helmkey($arg_x_ddd,$arg_Y_ddd,$arg_X_mmm,$arg_Y_mmm){
/*Подразумеваем что размер массивов на входе одинаковый*/
/* Результат:
$out[0] - массив невязок X
$out[1] - массив невязок Y
$out[3] = Коэффициэнт К
$out[4] = X_0
$out[5] = Y_0
$out[6] = gamma
*/
/*Cуммируем координаты*/
	for($i = 0; $i < count($arg_x_ddd); $i++){
		$summ_cord[0] += $arg_x_ddd[$i];
		$summ_cord[1] += $arg_Y_ddd[$i];
		$summ_cord[2] += $arg_X_mmm[$i];
		$summ_cord[3] += $arg_Y_mmm[$i];
	}
	$summ_cord[4]=$i+1;
/*Центр гравитации*/
	for($i = 0; $i < 2; $i++){	//всего два шага цикла для перебора элементов массива 0 и 1, переделать в явный вид без циклов надо
    	$xc[$i] = $summ_cord[$i] / $summ_cord[4];		//тут вычисляется средняя арифметическая координата x и y градусная
    	$yc[$i] = $summ_cord[2 + $i] / $summ_cord[4];	//тут вычисляется средняя арифметическая координата x и y метровая
	}
/*Сумма продуктов*/
	for($i = 0; $i < count($arg_x_ddd); $i++){	//Перебераем весь массив входящих координат
/*Разница координат*/
		$dx[0] = $arg_x_ddd[$i] - $xc[0];		//координата относительно среднего центра x градусная
		$dx[1] = $arg_Y_ddd[$i] - $xc[1];		//координата относительно среднего центра y градусная
		$dy[0] = $arg_X_mmm[$i] - $yc[0];		//координата относительно среднего центра x метровая
		$dy[1] = $arg_Y_mmm[$i] - $yc[1];		//координата относительно среднего центра y метровая
/*Сумируем*/
		$summ_matrix[0] += $dx[0] * $dx[0];		// X сумма квадратов градусы
/*		$summ_matrix[1] += $dx[0] * $dx[1]; Закомментировал автор кода на С */
		$summ_matrix[2] += $dx[1] * $dx[1];		// Y сумма квадратов градусы
		$summ_matrix[3] += $dx[0] * $dy[0];		// сумма произведений X градусного и метрового
		$summ_matrix[4] += $dx[1] * $dy[0];		// сумма произведений Y градусного и X метрового
		$summ_matrix[5] += $dx[0] * $dy[1];		// сумма произведений X градусного и Y метрового
		$summ_matrix[6] += $dx[1] * $dy[1];		// сумма произведений Y градусного и метрового
	}

/*Helmert параметры*/
	$det = $summ_matrix[0] + $summ_matrix[2];															//сумма X и Y сумм квадаратов градусов относительно среднего центра
	$h[0] = ($summ_matrix[3] + $summ_matrix[6]) / $det;										//
	$h[1] = ($summ_matrix[4] - $summ_matrix[5]) / $det;
	$h[2] = $yc[0] - $h[0] * $xc[0] - $h[1] * $xc[1];
	$h[3] = -$h[1];  /* Test it!*/
	$h[4] = $h[0];
	$h[5] = $yc[1] - $h[3] * $xc[0] - $h[4] * $xc[1];

/*Установка альтернативных параметров Helmert*/
	$mu = hypot($h[0], $h[1]);
	$theta = atan2($h[1], $h[0]);
/*Печатаем на выход*/
	$out[3] = $mu;
	$out[4] = $h[2];
	$out[5] = $h[5];
	$out[6] = $theta / pi() * 180;
/*	echo '+k='.$mu.' +x_0='.$h[2].' +y_0='.$h[5].' +gamma='.($theta / pi() * 180); Вывод на печать отключен*/

/* Выходные остатки */
	for($i = 0; $i < count($arg_x_ddd); $i++){
/*Модель У*/
	    $yh[0] = $h[0] * $arg_x_ddd[$i] + $h[1] * $arg_Y_ddd[$i] + $h[2];
	    $yh[1] = $h[3] * $arg_X_mmm[$i] + $h[4] * $arg_Y_mmm[$i] + $h[5];
		$out[0][$i] = $yh[0] - $arg_X_mmm[$i];
		$out[1][$i] = $yh[1] - $arg_Y_mmm[$i];
	}
	return $out;
}
?>
